\documentclass[a4paper,12pt]{article}

\input{header.tex}

\title{Отчёт по лабораторной работе \\ <<Динамическая IP-маршрутизация>>}
\author{Дун Юйхань}

\begin{document}

\maketitle

\tableofcontents

\section{Настройка сети}

\subsection{Топология сети}

Топология сети и используемые IP-адреса показаны на рисунке~\ref{fig:network}.

\begin{figure}
\centering
\includegraphics[width=0.8\textwidth]{includes/network_gv.pdf}
\caption{Топология сети}
\label{fig:network}
\end{figure}

Перечень узлов, на которых используется динамическая IP-маршрутизация: r1-r4, wsp1


\subsection{Назначение IP-адресов}

Ниже приведён файл сетевой настройки маршрутизатора r1.

\begin{Verbatim}
auto lo
iface lo inet loopback

auto eth0
iface eth0 inet static
	address 10.0.30.2
	netmask 255.255.255.0

auto eth1
iface eth1 inet static
	address 10.0.20.2
	netmask 255.255.255.0
\end{Verbatim}

Ниже приведён файл сетевой настройки рабочей станции wsp1.

\begin{Verbatim}
auto lo
iface lo inet loopback

auto eth0
iface eth0 inet static
	address 10.0.20.3
	netmask 255.255.255.0
\end{Verbatim}

\subsection{Настройка протокола RIP}

Ниже приведен файл \Code{/etc/quagga/ripd.conf} маршрутизатора r1.

\begin{Verbatim}
router rip

network eth0
network eth1
network eth2

timers basic 10 60 120

redistribute kernel

log file /var/log/quagga/ripd.log
\end{Verbatim}

Ниже приведен файл \Code{/etc/quagga/ripd.conf} рабочий станции, связанной с несколькими маршрутизаторами wsp1.

\begin{Verbatim}
router rip

network eth0

timers basic 10 60 120

redistribute kernel
redistribute connected

log file /var/log/quagga/ripd.log
\end{Verbatim}


\section{Проверка настройки протокола RIP}

Вывод \textbf{traceroute} от узла wsp1 до ws1 при нормальной работе сети.

\begin{Verbatim}
wsp1:~# traceroute 10.0.10.2
traceroute to 10.0.10.2 (10.0.10.2), 64 hops max, 40 byte packets
 1  10.0.20.1 (10.0.20.1)  4 ms  3 ms  1 ms
 2  10.0.10.2 (10.0.10.2)  2 ms  6 ms  2 ms
\end{Verbatim}

Вывод \textbf{traceroute} от узла wsp1 до внешнего IP (195.19.38.2 сгодится).

\begin{Verbatim}
Сюда нужно поместить вывод traceroute.
\end{Verbatim}

Вывод сообщения RIP.

\begin{Verbatim}
r2:~# tcpdump -tvn -s 1518 udp -i eth0
tcpdump: listening on eth0, link-type EN10MB (Ethernet), capture size 1518 bytes
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 92) 10.0.40.1.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 64, routes: 3
	  AFI: IPv4:       10.0.10.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.20.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.50.0/24, tag 0x0000, metric: 1, next-hop: self
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 112) 10.0.40.2.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 84, routes: 4
	  AFI: IPv4:         0.0.0.0/0 , tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.20.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.30.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.60.0/24, tag 0x0000, metric: 1, next-hop: self
\end{Verbatim}

Вывод таблицы RIP.

\begin{Verbatim}
r2# show ip rip

     Network            Next Hop         Metric From            Tag Time
R(n) 0.0.0.0/0          10.0.30.2             2 10.0.30.2         0 00:53
R(n) 10.0.10.0/24       10.0.40.1             3 10.0.40.1         0 00:59
R(n) 10.0.20.0/24       10.0.30.2             2 10.0.30.2         0 00:53
C(i) 10.0.30.0/24       0.0.0.0               1 self              0
C(i) 10.0.40.0/24       0.0.0.0               1 self              0
R(n) 10.0.50.0/24       10.0.40.1             2 10.0.40.1         0 00:59
C(r) 10.0.60.0/24       0.0.0.0               1 self (connected:1)  0
\end{Verbatim}

Вывод таблицы маршрутизации.

\begin{Verbatim}
r1:~# ip r
10.0.20.0/24 dev eth1  proto kernel  scope link  src 10.0.20.2 
10.0.50.0/24 via 10.0.20.1 dev eth1  proto zebra  metric 2 
10.0.60.0/24 via 10.0.30.1 dev eth0  proto zebra  metric 2 
10.0.30.0/24 dev eth0  proto kernel  scope link  src 10.0.30.2 
10.0.40.0/24 via 10.0.30.1 dev eth0  proto zebra  metric 2 
10.0.10.0/24 via 10.0.20.1 dev eth1  proto zebra  metric 2 
172.16.0.0/16 dev eth2  proto kernel  scope link  src 172.16.0.20 
default via 172.16.0.1 dev eth2 
\end{Verbatim}


\section{Расщепленный горизонт и испорченные обратные обновления}

Поместить сюда вывод сообщения одного и того же маршрутизатор с включенным расщ. горизонтом, с включенными испорченными обновлениями, с отключённым расщ. гор.

\begin{Verbatim}
#r3/etc/quagga/ripd.conf
interface eth0
ip rip split-horizon poisoned-reverse

#bash
r3:~# tcpdump -tnv -i eth0 -s 1518 udp
tcpdump: listening on eth0, link-type EN10MB (Ethernet), capture size 1518 bytes
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 112) 10.0.50.2.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 84, routes: 4
	  AFI: IPv4:         0.0.0.0/0 , tag 0x0000, metric: 3, next-hop: self
	  AFI: IPv4:       10.0.30.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.40.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.60.0/24, tag 0x0000, metric: 2, next-hop: self
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 172) 10.0.50.1.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 144, routes: 7
	  AFI: IPv4:         0.0.0.0/0 , tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.10.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.20.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.30.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.40.0/24, tag 0x0000, metric: 16, next-hop: 10.0.50.2
	  AFI: IPv4:       10.0.50.0/24, tag 0x0000, metric: 16, next-hop: self
	  AFI: IPv4:       10.0.60.0/24, tag 0x0000, metric: 16, next-hop: 10.0.50.2
\end{Verbatim}

\begin{Verbatim}
#r3/etc/quagga/ripd.conf
interface eth0
no ip rip split-horizon

#bash
r3:~# tcpdump -tnv -i eth0 -s 1518 udp
tcpdump: listening on eth0, link-type EN10MB (Ethernet), capture size 1518 bytes
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 172) 10.0.50.1.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 144, routes: 7
	  AFI: IPv4:         0.0.0.0/0 , tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.10.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.20.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.30.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.40.0/24, tag 0x0000, metric: 2, next-hop: 10.0.50.2
	  AFI: IPv4:       10.0.50.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.60.0/24, tag 0x0000, metric: 3, next-hop: self
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 92) 10.0.50.2.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 64, routes: 3
	  AFI: IPv4:       10.0.30.0/24, tag 0x0000, metric: 2, next-hop: self
	  AFI: IPv4:       10.0.40.0/24, tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.60.0/24, tag 0x0000, metric: 2, next-hop: self
\end{Verbatim}


\section{Имитация устранимой поломки в сети}

Маршрутизатор r4 был выключичен.

Вывод таблицы RIP непосредственно перед истечением таймера устаревания (на маршрутизаторе r3-соседе отключенного).

\begin{Verbatim}
r3# show ip rip

     Network            Next Hop         Metric From            Tag Time
R(n) 0.0.0.0/0          10.0.20.2             2 10.0.20.2         0 00:50
C(r) 10.0.10.0/24       0.0.0.0               1 self (connected:1)  0
C(i) 10.0.20.0/24       0.0.0.0               1 self              0
R(n) 10.0.30.0/24       10.0.20.2             2 10.0.20.2         0 00:50
R(n) 10.0.40.0/24       10.0.50.2             2 10.0.50.2         0 00:54
C(i) 10.0.50.0/24       0.0.0.0               1 self              0
R(n) 10.0.60.0/24       10.0.20.2             3 10.0.20.2         0 00:50

\end{Verbatim}

Перестроенная таблица на этом же маршрутизаторе

\begin{Verbatim}
r3# show ip rip

     Network            Next Hop         Metric From            Tag Time
R(n) 0.0.0.0/0          10.0.20.2             2 10.0.20.2         0 00:52
C(r) 10.0.10.0/24       0.0.0.0               1 self (connected:1)  0
C(i) 10.0.20.0/24       0.0.0.0               1 self              0
R(n) 10.0.30.0/24       10.0.20.2             2 10.0.20.2         0 00:52
R(n) 10.0.40.0/24       10.0.20.2             3 10.0.20.2         0 00:52
C(i) 10.0.50.0/24       0.0.0.0               1 self              0
R(n) 10.0.60.0/24       10.0.20.2             3 10.0.20.2         0 00:52

\end{Verbatim}

Вывод \textbf{traceroute} от узла ws1 до ws2 после того, как служба RIP перестроила таблицы маршрутизации.

\begin{Verbatim}
ws1:~# traceroute 10.0.60.2
traceroute to 10.0.60.2 (10.0.60.2), 64 hops max, 40 byte packets
 1  10.0.10.1 (10.0.10.1)  0 ms  0 ms  0 ms
 2  10.0.20.2 (10.0.20.2)  1 ms  1 ms  1 ms
 3  10.0.30.1 (10.0.30.1)  1 ms  1 ms  1 ms
 4  10.0.60.2 (10.0.60.2)  12 ms  3 ms  3 ms
\end{Verbatim}

\section{Имитация неустранимой поломки в сети}

маршрутизатор r3 был выключил. В данном случае сеть 10.0.10.0 будет недоступна.
Далее поместить таблицы протокола RIP, где видна 16-ая метрика.

\begin{Verbatim}
r1# show ip rip
Codes: R - RIP, C - connected, S - Static, O - OSPF, B - BGP
Sub-codes:
      (n) - normal, (s) - static, (d) - default, (r) - redistribute,
      (i) - interface

     Network            Next Hop         Metric From            Tag Time
K(r) 0.0.0.0/0          172.16.0.1            1 self              0
R(n) 10.0.10.0/24       10.0.20.1            16 10.0.20.1         0 00:50
C(i) 10.0.20.0/24       0.0.0.0               1 self              0
C(i) 10.0.30.0/24       0.0.0.0               1 self              0
R(n) 10.0.40.0/24       10.0.30.1             2 10.0.30.1         0 00:51
R(n) 10.0.50.0/24       10.0.30.1             3 10.0.30.1         0 00:51
R(n) 10.0.60.0/24       10.0.30.1             2 10.0.30.1         0 00:51
C(i) 172.16.0.0/16      0.0.0.0               1 self              0
\end{Verbatim}

сообщения протокола RIP с 16-ой метрикой.
\begin{Verbatim}
r1:~# tcpdump -tvn udp -i eth0
tcpdump: listening on eth0, link-type EN10MB (Ethernet), capture size 96 bytes
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 132) 10.0.30.2.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 104, routes: 5
	  AFI: IPv4:         0.0.0.0/0 , tag 0x0000, metric: 1, next-hop: self
	  AFI: IPv4:       10.0.10.0/24, tag 0x0000, metric: 16, next-hop: self[|rip]
IP (tos 0x0, ttl 1, id 0, offset 0, flags [DF], proto UDP (17), length 112) 10.0.30.1.520 > 224.0.0.9.520: 
	RIPv2, Response, length: 84, routes: 4
	  AFI: IPv4:       10.0.10.0/24, tag 0x0000, metric: 16, next-hop: self
	  AFI: IPv4:       10.0.40.0/24, tag 0x0000, metric: 1, next-hop: self[|rip]

\end{Verbatim}

\end{document}
